:PROPERTIES:
:ID:       3eb76f9d-5112-49a0-8b21-8976591d6fd6
:END:
#+title: ENG331 - Control Systems 1 - Assignment 4
#+date: [2025-09-19 Fri 09:20]
#+AUTHOR: Baley Eccles - 652137
#+FILETAGS: :Assignment:UTAS:2025:
#+LATEX_HEADER: \usepackage[a4paper, margin=2cm]{geometry}
#+LATEX_HEADER_EXTRA: \usepackage{minted}
#+LATEX_HEADER_EXTRA: \usepackage{fontspec}
#+LATEX_HEADER_EXTRA: \setmonofont{Iosevka}
#+LATEX_HEADER_EXTRA: \setminted{fontsize=\small, frame=single, breaklines=true}
#+LATEX_HEADER_EXTRA: \usemintedstyle{emacs}
#+LATEX_HEADER_EXTRA: \usepackage{float}
#+LATEX_HEADER_EXTRA: \usepackage[final]{pdfpages}
#+LATEX_HEADER_EXTRA: \setlength{\parindent}{0pt}
#+LATEX_HEADER_EXTRA: \setlength{\parskip}{1em}

* Question 1
** a
Using $T(s) = \frac{G(s)}{1 + G(s)H(s)}$
\begin{align*}
G(s) &= \frac{K100(s+1)(s^2 - 4s + 104)}{(s+3)(100s^2 + 2475s - 3467)} \textrm{ and } H(s) = 1 \\
T(s) &= \frac{\frac{K100(s+1)(s^2 - 4s + 104}{(s+3)(100s^2 + 2475s - 3467)}}{1 + \frac{K100(s+1)(s^2 - 4s + 104}{(s+3)(100s^2 + 2475s - 3467)}1} \\
T(s) &= \frac{100 K s^{3} - 300 K s^{2} + 10000 K s + 10400 K}{100 K s^{3}  + 100 s^{3} - 300 K s^{2} + 2775 s^{2} + 10000 K s + 3958 s - 10401  + 10400 K}
\end{align*}
#+BEGIN_SRC octave :exports none :results output :session Q1
clc
clear
close all

pkg load symbolic

syms s K;
H = 1;
G = (K*100*(s+1)*(s^2 - 4*s + 104))/((s+3)*(100*s^2 + 2475*s - 3467));

T = G/(1 + G*H);
% Simplify T
T_simplified = simplify(T);

% Get the numerator and denominator of T
[num, den] = numden(T_simplified);
latex(expand(num))
latex(expand(den))

#+END_SRC

#+RESULTS:
: Symbolic pkg v3.2.2: Python communication link active, SymPy v1.14.0.
: 100 K s^{3} - 300 K s^{2} + 10000 K s + 10400 K
: 100 K s^{3} - 300 K s^{2} + 10000 K s + 10400 K + 100 s^{3} + 2775 s^{2} + 3958 s - 10401

** b
\[100(K + 1) s^{3} +  (2775 - 300 K)s^{2} + (10000 K + 3958) s + (10400 K - 10401)\]
Using Routh–Hurwitz table:
#+ATTR_LATEX: :align |c|c|c|
|-------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+------------------------------------------------------------------------------------------|
| $s^3$ | $100(K+1)$                                                                                                                                                                                  | $10000K + 3958$                                                                          |
|-------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+------------------------------------------------------------------------------------------|
| $s^2$ | $2775 - 300K$                                                                                                                                                                               | $10400K - 10401$                                                                         |
|-------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+------------------------------------------------------------------------------------------|
| $s^1$ | $\frac{-\begin{bmatrix}100(K + 1) & 10000 + 3958K \\ 2775 - 300K & 10400K - 10401\end{bmatrix}}{2775 - 300K} = \frac{2(-80800^2 + 531254K + 240471)}{3(4K-37)}$                             | $\frac{-\begin{bmatrix}100(K + 1) & 0 \\ 2775 - 300K & 0\end{bmatrix}}{2775 - 300K} = 0$ |
|-------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+------------------------------------------------------------------------------------------|
| $s^0$ | $\frac{-\begin{bmatrix}2775 - 300K & 10400K - 10401 \\ \frac{2(-80800^2 + 531254K + 240471)}{3(4K-37)} & 0\end{bmatrix}}{\frac{2(-80800^2 + 531254K + 240471)}{3(4K-37)}} = 10400K - 10401$ | $0$                                                                                      |
|-------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+------------------------------------------------------------------------------------------|

The system is unstable when the first column encounters a sign change, so we need to find when the following are greater than 0, which can be done with MATLAB:
#+BEGIN_SRC octave :exports code :results output :session Q1
syms K real positive;

eq1 = 100*(K+1) > 0;
sol1 = solve(eq1, K);

eq2 = 2775 - 300*K > 0;
sol2 = solve(eq2, K);

eq3 = (2*(-80800*K^2 + 531254*K + 240471))/(3*(4*K-37)) > 0;
sol3 = solve(eq3, K);

eq4 = 10400*K - 10401 > 0;
sol4 = solve(eq4, K);
#+END_SRC

#+RESULTS:
: sol1 = {}(0x0)
: sol2 = (sym) K < 37/4
: K < \frac{37}{4} \wedge \frac{265627}{80800} + \frac{\sqrt{89987759929}}{80800} < K
: sol4 = (sym)
: 
:   10401    
:   ───── < K
:   10400

Which gives the following inequalities
\begin{align*}
K &< 37/4 = 9.25\\
K &< \frac{265627}{80800} + \frac{\sqrt{89987759929}}{80800} \approx 7 \\
K &> \frac{10401}{10400} \approx 1
\end{align*}

Which means $1 < K < 7$.

** c
Taking $K = \frac{7-1}{2} = 3$
\begin{align*}
K_p &= \lim_{s\rightarrow 0}G(s) = \frac{300 \left(s + 1\right) \left(s^{2} - 4 s + 104\right)}{\left(s + 3\right) \left(100 s^{2} + 2475 s - 3467\right)} = -3 \\
e_{step}(\infty) &= \frac{1}{1 + K_p} \\
e_{step}(\infty) &= \frac{1}{1 - 3} = -0.5\\
\end{align*}


#+BEGIN_SRC octave :exports none :results output :session Q1
syms s K
G = subs(G, K, 3);
latex(G)
K_p = double(subs(G, s, 0))

1/(1 + K_p)
#+END_SRC

#+RESULTS:
: \frac{300 \left(s + 1\right) \left(s^{2} - 4 s + 104\right)}{\left(s + 3\right) \left(100 s^{2} + 2475 s - 3467\right)}
: K_p = -2.9997
: ans = -0.5001

* Question 2
First we must convert the state space representation to laplace, then use Routh-Hurwitz. This can be done using $G(s) = C(sI - A)^{-1}B + D$.
\begin{align*}
G(s) &= C(sI - A)^{-1}B + D \\
G(s) &= \begin{bmatrix}
1 & 0 & 1
\end{bmatrix}
\left(
s
\begin{bmatrix}
1 & 0 & 0 \\
0 & 1 & 0 \\
0 & 0 & 1 
\end{bmatrix}
-
\begin{bmatrix}
0  & 1  & 0 \\
0  & 1  & 2 \\
-5 & -4 & -3 \\
\end{bmatrix}
\right)^{-1}
\begin{bmatrix}
0 \\
1 \\
0
\end{bmatrix}
+
\begin{bmatrix}
0
\end{bmatrix}
\end{align*}
Using MATLAB to solve this:
#+BEGIN_SRC octave :exports code :results output :session Q2
clc
clear
close all;
pkg load symbolic
syms s

A = [0, 1, 0; 0, 1, 2; -5, -4, -3];
B = [0; 1; 0];
C = [1, 0, 1];
G = factor(C*inv(s*eye(3,3) - A)*B)
#+END_SRC

#+RESULTS:
: G = (sym)
: 
:     -(3⋅s + 2)    
:   ────────────────
:           ⎛ 2    ⎞
:   (s + 2)⋅⎝s  + 5⎠

Getting the closed-loop transfer function using $T(s) = \frac{G(s)}{1 - G(s)H(s)}$
\[T(s) = \frac{- 3 s - 2}{s^{3} + 2 s^{2} + 2 s + 8}\]
#+BEGIN_SRC octave :exports none :results output :session Q2
H = 1;
T = simplify(G/(1 + G*H));

[num, den] = numden(T);
latex(expand(num))
latex(expand(den))
#+END_SRC

#+RESULTS:
: - 3 s - 2
: s^{3} + 2 s^{2} + 2 s + 8

Using the denominator and Routh-Hurwitz:
#+ATTR_LATEX: :align |c|c|c|
|-----+---------------------------------------------------------------+-------------------------------------------------------------|
| s^3 |                                                             1 |                                                           2 |
|-----+---------------------------------------------------------------+-------------------------------------------------------------|
| s^2 |                                                             2 |                                                           8 |
|-----+---------------------------------------------------------------+-------------------------------------------------------------|
| s^1 |  $\frac{-\begin{bmatrix}1 & 2 \\ 2 & 8\end{bmatrix}}{2} = -2$ | $\frac{-\begin{bmatrix}1 & 9 \\ 2 & 0\end{bmatrix}}{2} = 0$ |
|-----+---------------------------------------------------------------+-------------------------------------------------------------|
| s^0 | $\frac{-\begin{bmatrix}2 & 8 \\ -2 & 0\end{bmatrix}}{-2} = 8$ |                                                           0 |
|-----+---------------------------------------------------------------+-------------------------------------------------------------|
There are sign changes in the first column of the table, so the system is unstable.

* Question 3
** a
Using $\frac{G(s)}{1 + G(s)H(s)}$ and then multiplication:
\begin{align*}
\frac{\theta_0(s)}{\theta_c(s) - \theta_0(s)} &= \frac{s + 0.01}{s}\cdot\frac{1}{s}\cdot\frac{\frac{K_c}{s}\frac{1}{s}\frac{s + 0.01}{s}}{1 + \frac{K_c}{s}\frac{1}{s}\frac{s + 0.01}{s}} \\
\frac{\theta_0(s)}{\theta_c(s) - \theta_0(s)} &= \frac{10000 K_{c} s^{2} + 200 K_{c} s + K_{c}}{10000 J s^{4} + 10000 K_{c} s^{3} + 100 K_{c} s^{2}}
\end{align*}


#+BEGIN_SRC octave :exports none :results output :session Q3
clc
clear
close all
pkg load symbolic
syms s K_c J

G_1 = (s + 0.01)/s;
G_2 = K_c/J;
G_3 = 1/s;
G_4 = (G_1*G_2*G_3)/(1 + G_1*G_2*G_3);
G = simplify(G_1*G_4*G_3)

[num, den] = numden(G);

latex(expand(num))
latex(expand(den))
#+END_SRC

#+RESULTS:
#+begin_example
warning: passing floating-point values to sym is dangerous, see "help sym"
warning: called from
    double_to_sym_heuristic at line 50 column 7
    sym at line 384 column 13
    plus at line 53 column 5
G = (sym)

                          2          
           K_c⋅(100⋅s + 1)           
  ───────────────────────────────────
       2 ⎛       2                  ⎞
  100⋅s ⋅⎝100⋅J⋅s  + K_c⋅(100⋅s + 1)⎠
10000 K_{c} s^{2} + 200 K_{c} s + K_{c}
10000 J s^{4} + 10000 K_{c} s^{3} + 100 K_{c} s^{2}
#+end_example

** b
\begin{align*}
K_p &= \lim_{s\rightarrow 0}G(s) = \frac{10000 K_{c} s^{2} + 200 K_{c} s + K_{c}}{10000 J s^{4} + 10000 K_{c} s^{3} + 100 K_{c} s^{2}} = \infty\\
e_{step}(\infty) &= \frac{1}{1 + K_p} \\
e_{step}(\infty) &= \frac{1}{1 - \infty} = 0\\
\end{align*}

#+BEGIN_SRC octave :exports none :results output :session Q3
syms s K
latex(G)
K_p = double(subs(G, s, 0))

1/(1 + K_p)
#+END_SRC

#+RESULTS:
: \frac{K_{c} \left(100 s + 1\right)^{2}}{100 s^{2} \left(100 J s^{2} + K_{c} \left(100 s + 1\right)\right)}
: K_p =  Inf + Infi
: ans = 0

** c
\begin{align*}
K_v &= \lim_{s\rightarrow 0}sG(s) = s\frac{10000 K_{c} s^{2} + 200 K_{c} s + K_{c}}{10000 J s^{4} + 10000 K_{c} s^{3} + 100 K_{c} s^{2}} = \infty \\
e_{ramp}(\infty) &= \frac{1}{K_v} \\
e_{ramp}(\infty) &= \frac{1}{\infty} = 0\\
\end{align*}

#+BEGIN_SRC octave :exports none :results output :session Q3
syms s K
latex(G)
K_v = double(subs(s*G, s, 0))

1/(K_v)
#+END_SRC

#+RESULTS:
: \frac{K_{c} \left(100 s + 1\right)^{2}}{100 s^{2} \left(100 J s^{2} + K_{c} \left(100 s + 1\right)\right)}
: K_v =  Inf + Infi
: ans = 0
** d
\begin{align*}
K_a &= \lim_{s\rightarrow 0}s^2G(s) = s^2\frac{10000 K_{c} s^{2} + 200 K_{c} s + K_{c}}{10000 J s^{4} + 10000 K_{c} s^{3} + 100 K_{c} s^{2}} = 0.01\\
e_{parabola}(\infty) &= \frac{1}{K_a} \\
e_{parabola}(\infty) &= \frac{1}{0.01} = 100
\end{align*}

#+BEGIN_SRC octave :exports none :results output :session Q3
syms s K
latex(G)
K_a = double(subs(s*s*G, s, 0))

1/(K_a)
#+END_SRC

#+RESULTS:
: \frac{K_{c} \left(100 s + 1\right)^{2}}{100 s^{2} \left(100 J s^{2} + K_{c} \left(100 s + 1\right)\right)}
: K_a = 0.010000
: ans = 100

** e
Using $\frac{G(s)}{1 + G(s)}$:
\begin{align*}
\frac{\theta_0(s)}{\theta_c(s)} &= \frac{\frac{10000 K_{c} s^{2} + 200 K_{c} s + K_{c}}{10000 J s^{4} + 10000 K_{c} s^{3} + 100 K_{c} s^{2}}}{1 + \frac{10000 K_{c} s^{2} + 200 K_{c} s + K_{c}}{10000 J s^{4} + 10000 K_{c} s^{3} + 100 K_{c} s^{2}}} \\
&= \frac{10000 K_{c} s^{2} + 200 K_{c} s + K_{c}}{10000 J s^{4} + 10000 K_{c} s^{3} + 10100 K_{c} s^{2} + 200 K_{c} s + K_{c}} \\
\end{align*}

#+BEGIN_SRC octave :exports none :results output :session Q3
T = G/(1 + G);
T_s = simplify(T);
latex(expand(T_s))
[num, den] = numden(T_s);
latex(expand(num))
latex(expand(den))
#+END_SRC

#+RESULTS:
: \frac{10000 K_{c} s^{2}}{10000 J s^{4} + 10000 K_{c} s^{3} + 10100 K_{c} s^{2} + 200 K_{c} s + K_{c}} + \frac{200 K_{c} s}{10000 J s^{4} + 10000 K_{c} s^{3} + 10100 K_{c} s^{2} + 200 K_{c} s + K_{c}} + \frac{K_{c}}{10000 J s^{4} + 10000 K_{c} s^{3} + 10100 K_{c} s^{2} + 200 K_{c} s + K_{c}}
: 10000 K_{c} s^{2} + 200 K_{c} s + K_{c}
: 10000 J s^{4} + 10000 K_{c} s^{3} + 10100 K_{c} s^{2} + 200 K_{c} s + K_{c}


** f
Letting $\frac{K_c}{J} = A$, then the denominator becomes $10000 s^{4} + 10000 A s^{3} + 10100 A s^{2} + 200 A s + A$
#+ATTR_LATEX: :align |c|c|c|c|
|-----+--------------------------------------------------------------------------------------------------------------------------------------------------------------------+--------------------------------------------------------------------------------------------+-------------------------------------------------------------------------------|
| s^4 | $10 000$                                                                                                                                                           | $10 100A$                                                                                  | $A$                                                                           |
|-----+--------------------------------------------------------------------------------------------------------------------------------------------------------------------+--------------------------------------------------------------------------------------------+-------------------------------------------------------------------------------|
| s^3 | $10 000A$                                                                                                                                                          | $200A$                                                                                     | $0$                                                                           |
|-----+--------------------------------------------------------------------------------------------------------------------------------------------------------------------+--------------------------------------------------------------------------------------------+-------------------------------------------------------------------------------|
| s^2 | $\frac{-\begin{bmatrix}10 000 & 10 100A \\ 10 000A & 200A \end{bmatrix}}{10 000A} = 10100 A - 200$                                                                 | $\frac{-\begin{bmatrix}10 000 & A \\ 10 000A & 0 \end{bmatrix}}{10 000A} = A$              | $\frac{-\begin{bmatrix}10 000 & 0 \\ 10 000A & 0 \end{bmatrix}}{10 000A} = 0$ |
|-----+--------------------------------------------------------------------------------------------------------------------------------------------------------------------+--------------------------------------------------------------------------------------------+-------------------------------------------------------------------------------|
| s^1 | $\frac{-\begin{bmatrix}10 000A & 200A \\ 10100 A - 200 & A \end{bmatrix}}{10100 A - 200} = \frac{100 A \left(201 A - 4\right)}{101 A - 2}$                         | $\frac{-\begin{bmatrix}10 000A & 0 \\ 10100 A - 200 & 0 \end{bmatrix}}{10100 A - 200} = 0$ | 0                                                                             |
|-----+--------------------------------------------------------------------------------------------------------------------------------------------------------------------+--------------------------------------------------------------------------------------------+-------------------------------------------------------------------------------|
| s^0 | $\frac{-\begin{bmatrix}10100 A - 200 & A \\ \frac{100 A \left(201 A - 4\right)}{101 A - 2} & 0 \end{bmatrix}}{\frac{100 A \left(201 A - 4\right)}{101 A - 2}} = A$ | 0                                                                                          | 0                                                                             |
|-----+--------------------------------------------------------------------------------------------------------------------------------------------------------------------+--------------------------------------------------------------------------------------------+-------------------------------------------------------------------------------|


#+BEGIN_SRC octave :exports none :results output :session Q3
syms A
a = [10000, 10100*A; 10000*A, 200*A];
b = -1*det(a)/(10000*A);
latex(b)
latex(simplify(b))

c = [10000, A; 10000*A, 0];
d = -1*det(c)/(10000*A);
latex(b)

e = [10000*A, 200*A; b, A];
f = -1*det(e)/(b);
latex(simplify(f))

i = [b, A; f, 0]
f
j = -1*det(i)/(f)
latex(simplify(j))

#+END_SRC

#+RESULTS:
#+begin_example
\frac{101000000 A^{2} - 2000000 A}{10000 A}
10100 A - 200
\frac{101000000 A^{2} - 2000000 A}{10000 A}
\frac{100 A \left(201 A - 4\right)}{101 A - 2}
i = (sym 2×2 matrix)

  ⎡              2                  ⎤
  ⎢   101000000⋅A  - 2000000⋅A      ⎥
  ⎢   ────────────────────────     A⎥
  ⎢           10000⋅A               ⎥
  ⎢                                 ⎥
  ⎢        ⎛         2          ⎞   ⎥
  ⎢10000⋅A⋅⎝2010000⋅A  - 40000⋅A⎠   ⎥
  ⎢──────────────────────────────  0⎥
  ⎢              2                  ⎥
  ⎣   101000000⋅A  - 2000000⋅A      ⎦
f = (sym)

          ⎛         2          ⎞
  10000⋅A⋅⎝2010000⋅A  - 40000⋅A⎠
  ──────────────────────────────
                2               
     101000000⋅A  - 2000000⋅A
j = (sym)

   ⎛           2            ⎞ ⎛         3        2⎞ 
  -⎝101000000⋅A  - 2000000⋅A⎠⋅⎝- 20100⋅A  + 400⋅A ⎠ 
  ──────────────────────────────────────────────────
                          ⎛         2          ⎞    
      10000⋅A⋅(101⋅A - 2)⋅⎝2010000⋅A  - 40000⋅A⎠
A
#+end_example

For the system to be stable there must be no sign changes in the left column, this can be solved using the following MATLAB code:

#+BEGIN_SRC octave :exports code :results output :session Q3
syms A real;

eq1 = 10000 > 0;
sol1 = solve(eq1, A);

eq2 = 10100*A - 200 > 0;
sol2 = solve(eq2, A);

eq3 =  (100*A*(201*A - 4))/(101*A - 2) > 0;
sol3 = solve(eq3, A);

eq4 = A > 0;
sol4 = solve(eq4, A);
#+END_SRC

#+RESULTS:
: \left(\left(0 < A \wedge A < \frac{2}{101}\right) \vee \frac{4}{201} < A\right) \wedge \frac{2}{101} < A
: sol1 = {}(0x0)
: sol2 = (sym) 2/101 < A
: sol3 = (sym) (0 < A ∧ A < 2/101) ∨ 4/201 < A
: sol4 = (sym) 0 < A
: ans = 0.019900

Which means $\frac{K_c}{J} > 0.0199$
